#author: 王晓龙
#time: 2020/11/17 13:22
# 支持链式赋值
a = b = c = 11 # a,b,c共用一个内存空间
print(a,b,c,id(a),id(b),id(c))

#--------------支持参数赋值------------------
a = 50
a += 10 # 加等于
print("a = ",a)

a -= 10 # 减等于
print("a = ",a)

a *= 2 # 乘等于
print("a = ",a)

a /= 3 # 除等于
print("a = ",a)

a %= 3 # 余等于
print("a = ",a)

a = 21
a //= 2 # 整除等于
print("a = ",a)

#------------支持系列解包赋值---------------
a,b,c = 10,20,30 # 此时三个变量分别为不同的内存空间
print("a = ",a,id(a))
print("b = ",b,id(b))
print("c = ",c,id(c))
#解包赋值的作用，简化交换变量的步骤，两个变量交换值时不需要中间变量
i,j = 20,30
print("i = ",i,"j = ",j)
i,j = j,i # 交换两个变量的值
print("i = ",i,"j = ",j)


