# -*- coding: utf-8 -*-
# @Time    : 2020/11/22 9:29
# @Author  : Wxl
# @Email   : 154831156@qq.com
# @File    : 2.集合相关的操作.py
# @Software: PyCharm

s = {10,20,30,40,50}
'''1.判断指定的元素在集合中是否存在'''
print(10 in s) # True
print(100 not in s) # True

'''2.集合元素的增加操作'''
# 一次在集合中添加一个元素
s.add(80)
print(s) # {40, 10, 80, 50, 20, 30}
# 一次在集合中至少添加一个元素
s.update({100,111,222}) # 将集合添加到集合中
print(s) # {100, 40, 10, 111, 80, 50, 20, 222, 30}
s.update((1,2)) # 将元组添加到集合中
print(s) # {1, 2, 100, 40, 10, 111, 80, 50, 20, 222, 30}
s.update([3,4,5]) # 将列表添加到集合中
print(s) # {1, 2, 3, 100, 4, 5, 40, 10, 111, 80, 50, 20, 222, 30}

'''3.集合元素的删除操作'''
# 一次删除一个元素，如果元素不存在，则会抛出异常
s.remove(1)
print(s) # {2, 3, 100, 4, 5, 40, 10, 111, 80, 50, 20, 222, 30}

# 一次删除一个指定的元素，如果元素不存在，则不会抛出异常
s.discard(1000)
print(s) # 元素不存在，没有抛出异常 {2, 3, 100, 4, 5, 40, 10, 111, 80, 50, 20, 222, 30}

# 删除集合的起始元素，该函数不能指定参数
s.pop()
print(s) # {3, 100, 4, 5, 40, 10, 111, 80, 50, 20, 222, 30}
s.pop()
print(s) # {100, 4, 5, 40, 10, 111, 80, 50, 20, 222, 30}

# 清空集合中的元素
s.clear()
print(s) # set()
