# -*- coding: utf-8 -*-
# @Time    : 2020/11/20 17:34
# @Author  : Wxl
# @Email   : 154831156@qq.com
# @File    : 5.获取列表中的多个元素_切片操作.py
# @Software: PyCharm

'''
    切片操作的格式：
        list对象[开始的索引start:结束的索引stop:步长step]
            开始的索引默认为0，结束的索引默认为最后一个元素的索引，步长默认为1
            当步长为负数时，表示后边的元素排在前面，从后往前数
            所截取的范围：[start,stop)
'''
lst = [10,20,30,40,50,60,70,80]

print('-----------步长为正数(从前往后数)-----------')
print("原列表为：",lst) # [10, 20, 30, 40, 50, 60, 70, 80]
print(lst[::])   # [10, 20, 30, 40, 50, 60, 70, 80]
print(lst[0::])  # [10, 20, 30, 40, 50, 60, 70, 80]
print(lst[:5:])  # [10, 20, 30, 40, 50]
print(lst[0:3])  # [10, 20, 30]
print(lst[1:5:2])# [20, 40]

print('------------步长为负数(从后往前数)------------')
print('原列表为：',lst) # [10, 20, 30, 40, 50, 60, 70, 80]
print(lst[::-1])     # [80, 70, 60, 50, 40, 30, 20, 10]
print(lst[6:1:-1])   # [70, 60, 50, 40, 30]
print(lst[1:6:-1])   # []
print(lst[-2:-7:-1]) # [70, 60, 50, 40, 30]
print(lst[lst.index(70):lst.index(10):-2]) # [70, 50, 30]