# -*- coding: utf-8 -*-
# @Time    : 2020/11/22 10:48
# @Author  : Wxl
# @Email   : 154831156@qq.com
# @File    : 10.格式化字符串.py
# @Software: PyCharm

'''格式化输出字符串'''
name = '张三'
age = 25
# 1.使用%作为占位符(%d或%i代表整数,%s代表字符串,%f代表浮点数)
print('我叫%s,今年%d岁了' % (name,age)) # 我叫张三,今年25岁了

# 2.使用{}作为占位符
print('我叫{0},今年{1}岁了'.format(name,age)) # 我叫张三,今年25岁了

# 3.f-string的形式(Python3版本之后)
print(f'我叫{name},今年{age}岁了') # 前面加一个f,输出结果：我叫张三,今年25岁了

'''格式化数据的宽度和精度'''
print('%10.3f' % 3.1415926) #      3.142 宽度为10，精度精确到小数点后三位
print('{0:10.3}'.format(3.1415926)) #       3.14
print('{0:10.3f}'.format(3.1415926)) #      3.142
print(f'{3.1415926:10.3f}') #      3.142